In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("cast.csv")

In [3]:
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

 #### Create a copy of your actual data ------

In [4]:
df_dataset=df.copy()

In [5]:
print(df_dataset.head(3))

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4   NaN
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0

#### Basic information check

In [6]:
print(df_dataset.shape)

(3611212, 6)

In [7]:
print(df_dataset.dtypes)

title         object
year           int64
name          object
type          object
character     object
n            float64
dtype: object

In [8]:
print(df_dataset.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3611212 entries, 0 to 3611211
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 165.3+ MB
None

In [9]:
print(df_dataset.isnull().sum())

title              0
year               0
name               0
type               0
character          0
n            1379242
dtype: int64

 #### Fill those null values-----

In [10]:
df_dataset["n"]=df_dataset["n"].fillna(0)

In [11]:
print(df_dataset.isnull().sum())

title        0
year         0
name         0
type         0
character    0
n            0
dtype: int64

## Q-1 How many  movies are listed in the titles dataframe?

In [12]:
print(df_dataset["title"].shape)

(3611212,)

### Q-2 what are the earliest two films listed in the titles dataframe?

In [13]:
print(df_dataset["title"][0:2])

0     Closet Monster
1    Suuri illusioni
Name: title, dtype: object

### Q-3 How many movies have the title "Hamlet"?

In [14]:
print((df_dataset.title=="Hamlet").sum())

313

### Q-4 How many movies are titled "North by Northwest"?

In [15]:
print((df_dataset.title=="North by Northwest").sum())

112

### Q-5  When was the first movie titled "Hamlet" made?

In [16]:
df_dataset.loc[df_dataset.title=="Hamlet",["year"]]

         year
1615     1996
7438     1921
11242    2009
11243    2009
13907    1913
...       ...
3505738  1969
3528322  2000
3557773  1996
3562331  2015
3578802  1996

[313 rows x 1 columns]

### Q-6 List all of the "Treasure Island" movies from the earliest to most recent

In [17]:
(df_dataset.title=="Treasure Island").sum()

190

### Q-7 How  many movies were made in the year 1950?

In [18]:
print((df_dataset.year==1950).sum())

22006

### Q-8 How many movies were made in the year 1960?

In [19]:
print((df_dataset.year==1960).sum())

18456

### Q-10 In what years has a movie title "Batman" been released?

In [20]:
df_dataset.loc[df_dataset.title=="Batman",["year"]]

         year
95672    1943
96186    1943
114034   1989
119476   1989
149767   1989
...       ...
2907449  1989
3253550  1943
3343947  1989
3345872  1989
3356826  1989

[120 rows x 1 columns]

### Q-11 How many roles were there in the movie "Inception" ?

In [21]:
df_dataset.loc[df_dataset.title=="Inception",["character"]].value_counts()

character
Bridge Sub Con               7
Lobby Sub Con                5
Bar Sub Con                  5
Airport Patron               3
LAX Passenger                3
Penrose Sub Con              3
Businessman                  2
Pedestrian                   2
A Passer-By                  1
Phillipa (3 years)           1
Mombasan Cashier             1
Mombasan Casino Staff        1
Mombasan Gambler             1
Nash                         1
Old Cobb                     1
Old Mal                      1
Private Nurse                1
Phillipa (5 years)           1
Miles                        1
Reporter                     1
Robert Fischer               1
Saito                        1
Saito's Attendant            1
Saito's Bodyguard Officer    1
Stock Broker                 1
Stockbroker                  1
Street Person                1
Tadashi                      1
Thin Man                     1
Mombasa Casino Cashier       1
Lawyer                       1
Maurice Fischer              1
Mal                          1
Ariadne                      1
Arthur                       1
Blonde                       1
Browning                     1
Cab Driver                   1
Cobb                         1
Denison                      1
Eames                        1
Elderly Bald Man             1
Extra                        1
Fischer's Driver             1
Fischer's Jet Captain        1
Flight Attendant             1
French Student               1
Hotel Guest                  1
Immigration Officer          1
Italian Gambler              1
James (20 months)            1
James (3 years)              1
Japanese Landing Crew        1
Japanese Security Guard      1
Yusuf                        1
dtype: int64

### Q-12 How many role in the movie "inception" are NOT ranked by an "n" value?

In [22]:
df_dataset.loc[df_dataset.title=="Inception",["n"]].value_counts()

n
0.0     26
1.0      1
28.0     1
29.0     1
30.0     1
31.0     1
32.0     1
33.0     1
34.0     1
35.0     1
36.0     1
37.0     1
38.0     1
39.0     1
40.0     1
41.0     1
42.0     1
43.0     1
44.0     1
45.0     1
46.0     1
47.0     1
48.0     1
49.0     1
50.0     1
27.0     1
26.0     1
25.0     1
12.0     1
2.0      1
3.0      1
4.0      1
5.0      1
6.0      1
7.0      1
8.0      1
9.0      1
10.0     1
11.0     1
13.0     1
24.0     1
14.0     1
15.0     1
16.0     1
17.0     1
18.0     1
19.0     1
20.0     1
21.0     1
22.0     1
23.0     1
51.0     1
dtype: int64

### Q-14 Display the cast of "North by Northwest" in their correct "n"-value order,ignoring roles that did not earn a numeric "n" value

In [23]:
 df_dataset.loc[df_dataset.title=="North by Northwest",["n"]].value_counts()

n
0.0     96
9.0      1
15.0     1
14.0     1
13.0     1
12.0     1
11.0     1
10.0     1
8.0      1
1.0      1
7.0      1
6.0      1
5.0      1
4.0      1
3.0      1
2.0      1
16.0     1
dtype: int64

### Q-15  Display the entire cast, in "n"-order,of the 1972 film "Sleuth" ?

In [24]:
df_dataset.loc[df_dataset.title=="Sleuth",["n","year"]].value_counts()

n    year
0.0  2007    4
1.0  1972    1
     2007    1
2.0  1972    1
     2007    1
3.0  1972    1
     2007    1
4.0  1972    1
5.0  1972    1
6.0  1972    1
dtype: int64

### Q-16 Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth" ?

In [25]:
df_dataset.loc[df_dataset.title=="Sleuth",["year","n"]]

         year    n
250297   2007  0.0
314691   1972  2.0
314692   2007  1.0
360365   1972  3.0
360366   2007  0.0
1246855  2007  2.0
1396572  1972  6.0
1412647  1972  4.0
1644328  1972  1.0
1741124  2007  3.0
2619277  2007  0.0
2619278  1972  5.0
3223502  2007  0.0

### Q-17 How many roles were credited in the silent 1921 version of Hamlet?

In [26]:
df_dataset.loc[df_dataset.title=="Hamlet",["character","year","name"]]

                     character  year              name
1615     Attendant to Claudius  1996        Riz Abbasi
7438               Fortinbras,  1921  Fritz Achterberg
11242                  Laertes  2009      Hayden Adams
11243                   Player  2009      Hayden Adams
13907                 Reynaldo  1913       Eric Adeney
...                        ...   ...               ...
3505738             Court lady  1969    Jennifer Tudor
3528322               Gertrude  2000      Diane Venora
3557773          Second Player  1996     Perdita Weeks
3562331                Ophelia  2015   Katie (II) West
3578802                Ophelia  1996      Kate Winslet

[313 rows x 3 columns]

### Q-18 How many roles were credited in Branagh's 1996 Hamlet ?

In [32]:
df_dataset.loc[df_dataset.title=="Hamlet",["year","character"]].value_counts()

year  character
2000  Special Guest Appearance    16
1990  The Players                  8
1948  Extra                        4
1996  Attendant to Claudius        3
      Attendant to Gertrude        3
                                  ..
1969  Francisco                    1
      Gertrude                     1
      Gravedigger                  1
      Guildenstern                 1
2015  Rosencrantz                  1
Length: 280, dtype: int64

### Q-19 How many people have played an "ophelia" ?

In [47]:
(df_dataset.character=="ophelia").sum()

0

### Q-20 How many people have played a role called "The Dude" ?

In [46]:
(df_dataset.character=="The Dude").sum()

18

### Q-21 How many people have played a role called "The Stranger" ?

In [48]:
(df_dataset.character=="The Stranger").sum()

208

### Q-22 How many roles has Sidney poitier played throughout his career ?

In [50]:
print((df_dataset.name=="Sidney poitier").sum())

0

### Q-23  How many roles has Judi Dench played ?

In [51]:
print((df_dataset.name=="Judi Dench").sum())

55

### Q-26 How many roles were available for actors in the 1950s ?

In [55]:
df_dataset.loc[df_dataset.year==1950,["character"]].shape

(22006, 1)